{"software developer_20250323": {"jobs": [], "timestamp": 1742705183.420823}, "software developer_None_20250323": {"jobs": [{"title": "Software Developer", "company": "Rise Technical", "location": "West Midlands, UK", "description": "Software Developer Remote - 1 day a month on-site in Redditch £40,000 - £45,000  Flexible working hours  Learning & Development  Bonus This is an excellent opportunity for a Software Developer to join a nationally renowned business at an exciting time of growth where you will play a major part in the upcoming development project and have the chance to progress through the business. This company specialises in facilities management and building maintenance services across the UK, covering a wide…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5105055281?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=7397ADDD79205A6281BE06E4BD75FD556B41EFD5", "salary_min": 45000, "salary_max": 45000, "source": "Adzuna", "id": "adzuna_-4789168968467675450"}, {"title": "Software developer", "company": "MCS Group", "location": "Belfast, Northern Ireland", "description": "MCS Group is Looking for a Software Developer (12-18 Month Contract) - Remote First The Role MCS Group is hiring a Software Developer for a 12-18 month fixed term contract to play a key role in regulatory reporting, system maintenance, and web development. This position involves working with ASP.NET (VB), SQL Server, Crystal Reports, and MS Dynamics to ensure efficient data management and process automation. Key responsibilities include: Generating and submitting regulatory reports to external …", "url": "https://www.adzuna.co.uk/jobs/land/ad/5100378557?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=45D8BCA0770DB640AA45CF0D103B761B46E03DDC", "salary_min": 40000, "salary_max": 40000, "source": "Adzuna", "id": "adzuna_4918140962552236535"}, {"title": "Software Developer", "company": "MCS Group", "location": "Belfast, Northern Ireland", "description": "MCS Group is looking for a Software developer to develop and maintain software solutions within the manufacturing industry. This role involves everything from designing to testing software with systems to improve efficiency and data management. Key Responsibilities: Develop and improve software applications for workflows. Working with teams to improve system performance. Integrate software solutions and databases. Provide ongoing support and troubleshooting for systems. The Person: Software dev…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5103975369?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=CC07EAEBF25FBBE0FFAF1C5801E4E510130ED071", "salary_min": 45000, "salary_max": 45000, "source": "Adzuna", "id": "adzuna_-989805551804298907"}, {"title": "Software Developer", "company": "Ocho", "location": "Lisburn, Northern Ireland", "description": "Developers Needed to Join a Trusted Financial Solutions Leader Do you want to work for a company with a proven track record of industry leadership in financial outsourcing, steady growth, and commitment to staff and client security? Want to be part of a close-knit team that collaborates daily? How about contributing to innovative projects that truly make a difference in financial technology? The Role Our client is a household name for delivering advanced, secure, and client-focused solutions. E…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5062707038?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=B00FD07A7004F78379DDAC6108B98EA8C4CF48C6", "salary_min": 45000, "salary_max": 45000, "source": "Adzuna", "id": "adzuna_5911035944029168007"}, {"title": "Senior Software Developer", "company": "Rise Technical", "location": "West Midlands, UK", "description": "Senior Software Developer Remote - 1 day a month on-site in Redditch £50,000 - £60,000  Flexible working hours  Learning & Development  Bonus This is an excellent opportunity for a Senior Software Developer to join a nationally renowned business at an exciting time of growth where you will play a major part in the upcoming development project. This company specialises in facilities management and building maintenance services across the UK, covering a wide variety of industries. They specialise…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5105055275?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=24254F402224E5BD888C3CC0D7DC43F3B56445CC", "salary_min": 60000, "salary_max": 60000, "source": "Adzuna", "id": "adzuna_-7619263497315607833"}, {"title": "Senior Scientific Software Developer", "company": "Atomic Weapons Establishment ", "location": "Reading, Berkshire", "description": "Senior Scientific Software Developer Closing Date: 15th April 2025 Location: RG7 4RS , located between Reading and Basingstoke, with free onsite parking . Due to the classified nature of the work involved, there are limited opportunities to work from home in this role. It is anticipated that the successful candidate will spend the majority of their time working on site at AWE Blacknest. Package: £46,130 - £65,000 depending on your suitability, qualifications, and level of experience) A relocati…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5102019748?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=232240E245748B5F16D9A5ABC1CB2180979F3855", "salary_min": 46130, "salary_max": 65000, "source": "Adzuna", "id": "adzuna_-8209528361994934163"}, {"title": "Senior Software Developer", "company": "MCS Group", "location": "Belfast, Northern Ireland", "description": "Senior .NET Developer - Up to £60,000 - Belfast I am working with a leading company seeking a Senior Software Developer to take ownership of an exciting application built on Azure. This role requires expertise in .NET Core and Azure cloud services. Role Overview Develop and maintain software using .Net Frameworks and azure solutions Work on CI/CD pipelines and contribute to DevOps processes. Work alongside stakeholders to enhance and improve existing applications. What We're Looking For Over 5 …", "url": "https://www.adzuna.co.uk/jobs/land/ad/5063854246?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=DEB86455A537F41CE49B8A5399EBEBA57587409F", "salary_min": 60000, "salary_max": 60000, "source": "Adzuna", "id": "adzuna_187585379286333541"}, {"title": "Senior Software Developer", "company": "MCS Group", "location": "Belfast, Northern Ireland", "description": "MCS Group is partnering with an expanding organisation seeking a Senior Software Developer to contribute to their innovative journey. This hybrid role allows you to work from any of the company's nationwide offices, developing and enhancing cutting-edge software solutions that drive business operations and client services. Key Responsibilities As a Senior Software Developer, you will play a key role in building and maintaining scalable web applications using Laravel and React, ensuring high per…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5102064948?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=8E688ECC310615A58ED739D4E28B8EC84B5C6591", "salary_min": 70000, "salary_max": 70000, "source": "Adzuna", "id": "adzuna_4975427419167911149"}, {"title": "Software Developer - .Net", "company": "VANRATH", "location": "Belfast, Northern Ireland", "description": "An excellent opportunity to work with a Software House as they begin the next stage of expansion in their Belfast based office Tech Stack: C#/.Net, SQL Salary range: £45K - £60K Working Arrangement: Belfast (Hybrid) About the Role: Work closely with team and Architect in building solutions Take ownership on key feature developments Mentor Junior Software Engineers Document and update software functionality Key Requirements: 3 years software development experience (.Net) Cloud exposure (AWS, Azu…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5102064929?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=C3F62FA3AF26BAF3FAD1B4774098FAC1B151E8F0", "salary_min": 60000, "salary_max": 60000, "source": "Adzuna", "id": "adzuna_600777290209503077"}, {"title": "Senior Software Developer", "company": "MCS Group", "location": "Belfast, Northern Ireland", "description": "MCS is excited to be working exclusively in the search for a Senior Backend Software Engineer to join a dynamic and forward-thinking technology team in Belfast. This is an exciting opportunity to work with a company dedicated to connecting businesses in their sector. About the Role: As a Senior Backend Software Engineer, you will play a key role in designing and building scalable, reliable services that power the company's platform. Working within a cross-functional team, you will contribute to…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5103975394?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=7C09DAFA50C540E86D925E6C6B7060CB1BC97A63", "salary_min": 70000, "salary_max": 70000, "source": "Adzuna", "id": "adzuna_4714825489044435638"}, {"title": "Software Developer", "company": "Network IT", "location": "Bridgnorth, Shropshire", "description": "Role: Software Developer (C# and SQL) Location: Bridgenorth (Initially Fully In-Office, 3 Days In-Office Per Week Once Settled) Salary: £55,000 - £65,000 Network IT are looking for an exceptional Software Developer to join our clients small internal development team who are undertaking a significant software transformation programme . You will undertake hands-on work supporting significant company-wide projects alongside BAU responsibilities to keep their critical processes functioning. Our cli…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5073171148?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=4A96D1422A415C8EE9CCE39CD91BD9E58911FEE1", "salary_min": 65000, "salary_max": 65000, "source": "Adzuna", "id": "adzuna_7413799538197069661"}, {"title": "Software Developer", "company": "Network IT", "location": "Bridgnorth, Shropshire", "description": "Role: Software Developer (Predominantly SQL Server Backend) Location: Bridgenorth (Initially Fully In-Office, 3 Days In-Office Per Week Once Settled) Salary: £55,000 - £65,000 Network IT are looking for an exceptional Software Developer to join our clients small internal development team who are undertaking a significant software transformation programme . You will undertake hands-on work supporting significant company-wide projects alongside BAU responsibilities to keep their critical processe…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5099088832?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=7BA8892BF85072DA141E12C848BFE6B1E7B1AF1E", "salary_min": 65000, "salary_max": 65000, "source": "Adzuna", "id": "adzuna_-4733806706432376158"}, {"title": "Software Developer", "company": "Reynolds and Reynolds", "location": "Northfield, Birmingham", "description": "POSITION DESCRIPTION: Reynolds and Reynolds is currently seeking candidates who are highly motivated to work in the development of business applications. As a Software Developer, you will be part of a team of professionals whose role is to design, develop and test software to enhance the functionality of our business applications, which allow automotive retailers to run their business. You will also be responsible for diagnosing and fixing software faults, assisting with the ongoing development…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5072717119?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=2137E60C93B05991E206B833309C74D7A709C0CD", "salary_min": 38663.7, "salary_max": 38663.7, "source": "Adzuna", "id": "adzuna_-3741302283806087381"}, {"title": "Software Developer", "company": "McGregor Boyall Associates Limited", "location": "Edinburgh, Scotland", "description": "One of our public sector clients is looking for an experienced Software Developer to join their team on a contract basis. You will have the following skills and experience: Python 3 and/or Java 17 PostgreSQL/PostGIS High performance computing and geometric methods relating to GIS . Modern DevOps and CI/CD practices including deployment pipelines and Jenkins . AWS including: CDK, Serverless (Lambda), S3, SQS, API Gateway, Cloudformation, Aurora / Postgres Collaborative working in a crossfunction…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5066330834?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=057C360F78DC5C7BA5E8D14903F845709E58EEC1", "salary_min": 76482.61, "salary_max": 76482.61, "source": "Adzuna", "id": "adzuna_3163275556766552645"}, {"title": "Software Developer", "company": "Equinox", "location": "Headingley, Leeds", "description": "Who we are Were a Leeds-based tech company a friendly team of innovative, supportive, fair people. We understand that having fun is key to our wellbeing and our ability to produce high quality work. That's why weve kitted out our office with a pool table, table tennis, games consoles and a bar if youre stuck at your desk trying to solve a problem, a quick game really helps What we do We develop powerful intellectual property (IP) management software. Our system, Equinox IPMS, features advanced …", "url": "https://www.adzuna.co.uk/jobs/land/ad/5056679856?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=DF4DACB4028452CD4EACFE3DE6CB6E7C5E294229", "salary_min": 50000, "salary_max": 50000, "source": "Adzuna", "id": "adzuna_-4785959123846495135"}, {"title": "Software Developer", "company": "Yunex Limited", "location": "Waterloo, Poole", "description": "Company description: Software Developer Job description: Software Engineer Uniting whats next in traffic. At Yunex Traffic, we launch cities into the future with forward-looking infrastructure and transport solutions, making mobility safer, more efficient and more sustainable for all. Do you want to make a difference with the work you do? Join us as a Software Engineer. We are looking for a Software Engineer to join our exciting R&D department and support the Product Owner in delivering key fea…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5082213980?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=BC2378E2E0287C084D0F311BDABE97247F6B1847", "salary_min": 52371.78, "salary_max": 52371.78, "source": "Adzuna", "id": "adzuna_-2292626482846994768"}, {"title": "Software Developer", "company": "Develop", "location": "Liverpool, Merseyside", "description": "Contract Ruby Developer - 12-Month Contract - £400-£600 per day (Inside IR35) ?? Location: Liverpool -Hybrid (Flexible) Rate: £400-£600 per day (Inside IR35) Duration: 12 Months We are hiring a Ruby Contractor to support our client with the decommissioning of their existing Ruby-based systems. This is an exciting opportunity to work on a critical project, contributing to the strategic transition from legacy systems to a modernised tech stack. Skills and Experience Strong experience in Ruby and …", "url": "https://www.adzuna.co.uk/jobs/land/ad/5086101104?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=612C8B493E28726121A6394C838CB3D5CE64E0D1", "salary_min": 104000, "salary_max": 156000, "source": "Adzuna", "id": "adzuna_2399713690435931508"}, {"title": "Software Developer", "company": "Fintech Recruitment Solutions", "location": "Aberdeen, Aberdeenshire", "description": "A rapidly growing technical company has exclusively engaged FinTech Recruitment Solutions to manage the recruitment of a Software Developer. ‍Our dynamic, ambitious, future-proofing client is looking to recruit a developer to join their business while working closely with an experienced technical manager. The successful candidate will work on current applications and new developments alongside the development team. ‍Duties will include: Contribute to the development and enhancement of multiple …", "url": "https://www.adzuna.co.uk/jobs/land/ad/5085807149?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=836C6589F945893AE56240805B0E7223F08313D1", "salary_min": 25000, "salary_max": 35000, "source": "Adzuna", "id": "adzuna_-2310621637742463215"}, {"title": "Lead Software Developer/Applications Developer", "company": "Hays Technology", "location": "County Antrim, Northern Ireland", "description": "Are you a seasoned software developer looking to make a significant impact? Join my clients' dynamic team as a Senior Applications Development Technology Lead Analyst This senior-level role is pivotal in establishing and implementing innovative application systems and programs. Your expertise will drive our technology team forward, ensuring seamless integration and cutting-edge solutions. Key Responsibilities: Collaborate with Management Teams: Partner with various management teams to integrate…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5061572215?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=3C0451E76D491DDF65FEB8E583CABFC89F3AAC60", "salary_min": 55685.6, "salary_max": 55685.6, "source": "Adzuna", "id": "adzuna_5967592458922295103"}, {"title": "Software Developer", "company": "Live Wire Productions", "location": "Banbury, Oxfordshire", "description": "Role: Software Developer Location: Banbury For the past 10 years, Live Wire has worked across Formula 1, supplying technology to the major teams and F1 Management. Our work varies from constructing viewer experiences in teams' hospitality suites, paddock, garages and factories elevating each of the 24 races a year. We work closely with our suppliers to deliver pioneering technology and integrate innovation into all of the work we do. Live Wire provides AV technology for all genres of events inc…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5100122348?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=88D6AE4125578FA0D6C7C9C4333C9CDF29A52AA4", "salary_min": 42863.06, "salary_max": 42863.06, "source": "Adzuna", "id": "adzuna_3689800276495801060"}, {"title": "Software Developer", "company": "Hexegic", "location": "Eastern England, UK", "description": "The role This is an opportunity for a versatile software developer with a strong focus on front-end development and understanding of back-end architecture to contribute to the secure design, development and deployment of applications. You’ll have the opportunity to work in an innovative environment, with a small collaborative team. About us Hexegic are a leading technical consultancy providing agile multi-disciplinary teams to high performing organisations. The company promises exciting, engagi…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5082043963?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=FFFD649ECB2A234520B8D5AB92EDE6F5B95F8405", "salary_min": 50760.08, "salary_max": 50760.08, "source": "Adzuna", "id": "adzuna_5101884653337436932"}, {"title": "Software Developer", "company": "Bellway Homes", "location": "Newcastle Upon Tyne, Tyne & Wear", "description": "Software Developer When registering to this job board you will be redirected to the online application form. Please ensure that this is completed in full in order that your application can be reviewed. At Bellway we recognise that people are the key to our success and our goal is to provide a rewarding and fulfilling career in line with our values of quality, service and trust. In addition to this we are committed to being a more inclusive employer and invite applications from a variety of back…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5103636598?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=E9187682F9CF9F47FFF36C7D8EA0B841BC6C5646", "salary_min": 43879.7, "salary_max": 43879.7, "source": "Adzuna", "id": "adzuna_3916288234410982686"}, {"title": "Software Developer", "company": "Global Highland Limited", "location": "Haugh, Inverness", "description": "Our client is seeking a Software Developer who will support their Business Units efficiency through thedevelopment and design of specialised software. Whilst the focus will be to develop the existing web MVC applications as required,there is an aim to develop a user-friendly and efficient mobile application using .NETMAUI, ensuring compatibility across multiple platforms. Integrate with the existingdatabase and web application for required data. Therefore, it is a requirement thatthe developer …", "url": "https://www.adzuna.co.uk/jobs/land/ad/5048323311?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=2D47DBE2E08B81C1ADC3F9756422126BF3C7CF94", "salary_min": 52620.85, "salary_max": 52620.85, "source": "Adzuna", "id": "adzuna_8262886466377821810"}, {"title": "IT & Software Development Recruiter", "company": "Networker Global Limited", "location": "South East London, London", "description": "IT & Software Development Recruiters Keep Up to 90% of Your Margin Without the Hassle of Going Solo You know IT and software recruitment. Youve built a network of software engineers, DevOps specialists, cloud architects, and technical leaders. You know how to source, engage, and place top talent in fast-growing startups and enterprise tech teams. So why are you handing over most of your margin to an agency when you could be taking home up to 90%? Going independent sounds greatuntil you hit the …", "url": "https://www.adzuna.co.uk/jobs/land/ad/5106299179?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=3D1B9A6415D47D094F1EB68E5C16323E90BB442F", "salary_min": 36672.86, "salary_max": 36672.86, "source": "Adzuna", "id": "adzuna_-5955457515063452147"}, {"title": "Java Software Developer", "company": "Barclays UK", "location": "Knutsford, Cheshire", "description": "Join our Customer Care Technology team as a Java Software Developer , supporting the creation of a unified colleague desktop for Barclays Financial Assistance (BFA). In this role, you will contribute to building a strategic desktop solution using MCA2, aiming for full integration across digital and desktop channels. This solution will empower BFA colleagues to provide more personalized, consistent support to customers facing financial challenges. To be successful as a Java Software Developer , …", "url": "https://www.adzuna.co.uk/jobs/land/ad/5107102323?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=CA24324C307AED1150BF49110EA76CB8C3D9F30E", "salary_min": 24592.84, "salary_max": 24592.84, "source": "Adzuna", "id": "adzuna_3146679756859459215"}, {"title": "Java Software Developer", "company": "Barclays UK", "location": "Glasgow, Scotland", "description": "Join us as an experienced Java Software Developer at Barclays, where you will be making significant contributions to critical Financial Crime Anti-Money Laundering projects. You will be joining a highly skilled and experienced team who specialise in this domain providing essential software engineering and analytical services to progress mission critical customer journeys and business processes. The role offers an opportunity to hone existing expertise as well as acquire broader skills and exper…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5105443822?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=F8EAF7C4C7EE62F972B9FDE028C97C0DA4AB54EA", "salary_min": 30536.42, "salary_max": 30536.42, "source": "Adzuna", "id": "adzuna_4952247727614906910"}, {"title": "Software Developer", "company": "Oscar Associates  Limited", "location": "Belgrave, Leicester", "description": "Software Developer - PHP, JavaScript, React | Fintech | Hybrid (Leicestershire) | £40,000 - £50,000 Are you a talented Software Developer looking for an exciting challenge in the fintech space ? We're working with a growing, innovative fintech business in Leicestershire that's gearing up for a major product launch in Q4 2025 -and they need an experienced developer to join their team. The Role: As a Software Developer , you'll be joining a small but highly skilled team of three developers , repo…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5102501840?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=74A4B780533D3D87BE12E2D3B4BBB891EC822C39", "salary_min": 50000, "salary_max": 50000, "source": "Adzuna", "id": "adzuna_-6032691379051519645"}, {"title": "Software Developer", "company": "Intertek", "location": "Blackdog, Bridge Of Don", "description": "We have an exciting opportunity for a highly motivated and dedicated Software Developer to join our dynamic team. The ideal candidate will have a solid background developing applications using Python, C#, JavaScript, .Net, HTML and CSS. ABOUT YOU We are seeking a talented Software Developer to join our dynamic team on a 12-month fixed term contract. The successful candidate will play a crucial role in designing, developing, and maintaining high-quality software. We are seeking someone who has e…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5092716521?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=2FDDC1C334131389B9C056855B9990DEB7E7C7DE", "salary_min": 42025.2, "salary_max": 42025.2, "source": "Adzuna", "id": "adzuna_1323101450361188023"}, {"title": "Software Developer", "company": "Oscar Associates  Limited", "location": "Leicester, Leicestershire", "description": "Software Developer - C# .Net/React/AI - Hybrid - Leicester - £35,000 - £50,000 DOE The Role A constantly expanding and forward thinking Software House based in Leicester are looking for two talented Software Developers to join their development squad. From day one, you will be working on an exciting project utilising AI which is currently in its beta testing phase at the moment. You will be adding exciting new features, monitoring its delivery before moving onto greenfield applications. The rol…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5099866500?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=6A2E771D14F5A9EE79DDDBED1CD014E401F55C7C", "salary_min": 50000, "salary_max": 50000, "source": "Adzuna", "id": "adzuna_-2160970006127065096"}, {"title": "Software Developer", "company": "KO2 Embedded Recruitment Solutions LTD", "location": "Heap Bridge, Bury", "description": "Job Title: C# Software Developer (Embedded Linux Environment) Location : Bury, UK Salary : Up to £65,000 per annum Working Hours : 5 Days per week (On-site in Bury) Company Overview: Our client is a leading provider of vehicle telematics solutions, specializing in real-time monitoring, reporting, and firmware updates for vehicle systems. Based in Bury, they are at the forefront of developing innovative embedded software for a wide range of applications, with a particular focus on communication …", "url": "https://www.adzuna.co.uk/jobs/land/ad/5075946219?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=EE657999A1081644700EBA7666BF8F0F0E53E643", "salary_min": 65000, "salary_max": 65000, "source": "Adzuna", "id": "adzuna_-2992172195824310685"}, {"title": "Software Developer", "company": "Rise Technical Recruitment Limited", "location": "Redditch, Worcestershire", "description": "Software Developer Remote - 1 day a month on-site in Redditch £40,000 - £45,000  Flexible working hours  Learning & Development  Bonus This is an excellent opportunity for a Software Developer to join a nationally renowned business at an exciting time of growth where you will play a major part in the upcoming development project and have the chance to progress through the business. This company specialises in facilities management and building maintenance services across the UK, covering a wide…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5105471786?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=2C13F4C52F8D203260B0A206F7C31AD531B76B86", "salary_min": 45000, "salary_max": 45000, "source": "Adzuna", "id": "adzuna_-3962417200552260152"}, {"title": "Software Developer", "company": "The Sales Recruitment Network", "location": "Bedford, Bedfordshire", "description": "The sales recruitment network is looking to recruit a software developer for one of their dynamic organisations who invest in their staff. Fantastic opportunity for the right person. Design and build computer programs Maintain website Communicate with management and technical support Writing and repairing computer codes Managing software projects Ensuring all SLA's are met Performing trials, testing and quality checks Keeping detailed records of development processes Updating software databases…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5045887345?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=D80FCEF738A343CCF3AD1A6C6EA58572B733CC8D", "salary_min": 65000, "salary_max": 65000, "source": "Adzuna", "id": "adzuna_-8991302157757339"}, {"title": "Software Developer", "company": "Everpool", "location": "Cardiff County, Wales", "description": "Market leading company in Cardiff are seeking a Software Developer to become part of their IT department. If you would like to be part of a forward-thinking business and have a job with excellent career prospects, we would love to hear from you. Competitive salary plus package The role of Software Developer is to write, modify, debug, test and document software applications which may consist of stand-alone, interfaces and any that access servers or services. The holder of the role will use sour…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5064792716?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=8CE90B8439FDCDB4B78DE4F74FCC347C33385A01", "salary_min": 30000, "salary_max": 30000, "source": "Adzuna", "id": "adzuna_-6684816687260924145"}, {"title": "Software Developer", "company": "Oscar Associates  Limited", "location": "Liverpool, Merseyside", "description": "Software Developer | Liverpool | .Net / React | £40K-£50K DOE | Hybrid Our client are a dynamic and growing software company seeking a talented Full Stack Developer to join our innovative team. In this role, you'll work on a variety of exciting projects, from building responsive web applications to developing robust back-end systems. They're looking for someone with a strong understanding of both front-end and back-end technologies, a passion for problem-solving, and the ability to work in a co…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5079951082?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=5E106507D3B24058AFE4DC382AACB1DFE9FEEED0", "salary_min": 50000, "salary_max": 50000, "source": "Adzuna", "id": "adzuna_-6582428727876803511"}, {"title": "Software Developer", "company": "Technical Recruitment Solutions Ltd", "location": "Leatherhead, Surrey", "description": "Software Solutions Developer Job Type: Full-Time, Permanent About Us: Join our dynamic and innovative team, where we are at the forefront of manufacturing HVAC products. They specialize in delivering controls and Refrigeration Key Responsibilities: Design, develop, and test software to program to meet customer and market expectations Work on projects following various phases, from conception to feasibility analysis and subsequent development and testing, up to the finished project in a context …", "url": "https://www.adzuna.co.uk/jobs/land/ad/5106298346?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=1D3758DE22DB1E33B7B109552682A72DD26341D3", "salary_min": 40000, "salary_max": 40000, "source": "Adzuna", "id": "adzuna_6273993793803524977"}, {"title": "Software Developer", "company": "InterQuest Group  Limited", "location": "Rotherham, South Yorkshire", "description": "Web Developer Location: Remote/Hybrid Rotherham Salary: £40,000 - £50,000 Great opportunity to work for a leading independent finance broker with over 45 years of experience, helping customers secure the best financial products to suit their needs. Specializing in a range of financial solutions-including loans, mortgages, and insurance-our commitment to innovation and customer service drives us to continually evolve and improve our services. We are looking for a talented Web Developer to join o…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5106298254?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=2353639EE245775CFCBF066DD7215923E6CA07EB", "salary_min": 50000, "salary_max": 50000, "source": "Adzuna", "id": "adzuna_-5972238165687948090"}, {"title": "Software Developer", "company": "Searchability  Ltd", "location": "Liverpool, Merseyside", "description": ".NET Developer .NET, C#, SQL Server, JavaScript, Azure £50k salary Liverpool city centre Hybrid working About the client: We are a digitally focussed company who build bespoke software for customers who operate is a highly competitive market. As a partner to some of the biggest names within this industry, we pride ourselves on delivering best in class products that are built on a foundation of modern technology. The benefits: Bonus scheme Private healthcare Training budget Excellent on-going pr…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5064792721?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=7DEBB4627F800E02C7B72C03CF8BBBAF4D496B7B", "salary_min": 50000, "salary_max": 50000, "source": "Adzuna", "id": "adzuna_7347884441113208868"}, {"title": "Software Developer (C#)", "company": "Ernest Gordon Recruitment", "location": "Oldbury, West Midlands", "description": "Software Developer (C#) £40,000 - £45,000  Training  Progression  2 Yearly Bonuses  Share Scheme  Company Benefits Oldbury Are you a Software Developer with Delphi experience, looking to join one of the UK's largest construction companies, that will recognise your skills and expertise, and reward it with great benefits, training and development opportunities? On offer is the opportunity to join an industry leading business, known for their high staff retention and generous company. In this role…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5055364491?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=020EBEEA01260F3BAE697B85972587BF9EDA087B", "salary_min": 45000, "salary_max": 45000, "source": "Adzuna", "id": "adzuna_1012570247146721694"}, {"title": "Software Development Lead", "company": "Bright Purple", "location": "Glasgow, Scotland", "description": "Software Development Lead - Scotland (1 day a month Hamilton) We are looking for a Software Development Lead to work within a small team of java developers to interpret business requirements and technical specifications for education establishments. You will develop software for the application suite, including analysis, design, coding, testing and documentation. Benefits: Salary of £51,500 39 Days Holiday 1 day a month in office The Role: Consulting on and designing software products. Developm…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5100882785?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=BEF2693C3EF07BB75BF759A29C7B3B90D4EFF766", "salary_min": 50000, "salary_max": 50000, "source": "Adzuna", "id": "adzuna_4070322501900397321"}, {"title": "Software Development Lead", "company": "Bright Purple", "location": "Edinburgh, Scotland", "description": "Software Development Lead - Scotland (1 day a month Hamilton) We are looking for a Software Development Lead to work within a small team of java developers to interpret business requirements and technical specifications for education establishments. You will develop software for the application suite, including analysis, design, coding, testing and documentation. Benefits: Salary of £51,500 39 Days Holiday 1 day a month in office The Role: Consulting on and designing software products. Developm…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5102408836?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=B2F795B4EAF11B3FF55F92CF4FDBCEB0BC89CBFA", "salary_min": 50000, "salary_max": 50000, "source": "Adzuna", "id": "adzuna_3134264527891654734"}, {"title": "Principal Software Developer", "company": "Alces Flight", "location": "Bicester, Oxfordshire", "description": "PRINCIPAL SOFTWARE DEVELOPER / OXFORDSHIRE / UP TO £70,000 & GREAT BENEFITS Amazing new opportunity for a Principal Software Developer to join a niche and growing tech organisation. Excellent pay and challenging opportunities to help you realise your full potential Alces Flight Ltd designs and develops innovative software for AI&HPC systems across the UK. We are advocates of open-source software and strongly believe in community-driven development. We have a broad customer base in multiple mark…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5075143337?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=E551CB2CF9E51F77DE5D7BA3C305FE747385FB4F", "salary_min": 75000, "salary_max": 75000, "source": "Adzuna", "id": "adzuna_-6760217488855792210"}, {"title": "Software Development Engineer", "company": "Maclean Moore Ltd", "location": "Leeds, West Yorkshire", "description": "Our client, a leading global organisation, is partnering with a prestigious end client based in Leeds. We are excited to offer a fantastic opportunity for a talented Software Development Engineer to join a dynamic and agile development team on an initial 6-month contract, with the potential for extension. If you are interested and have the relevant skills and experience, please apply promptly to discuss further. Job Title: Software Development Engineer Location: Hybrid (1-2 days in office) - He…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5102006558?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=9EB9EB10B1A4BADB2D3AD9C120289B39A16EA259", "salary_min": 57821.53, "salary_max": 57821.53, "source": "Adzuna", "id": "adzuna_-2467856806287116192"}, {"title": "Experienced Software Developer", "company": "Talent Finder", "location": "Aldbury, Tring", "description": "Experienced Software Developer | Aldbury, near Tring | Hybrid working will be available | Full Time | £60,000  Our client is seeking an experienced Software Developer, like you, to join their team of 12 and contribute to their exciting range of products. If you thrive on technically challenging and diverse projects, this is the perfect opportunity for you. Located in the picturesque village of Aldbury, our client offers a relaxed working environment, that combines the charm of a countryside set…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5067535835?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=6A44843F56B781BCB5D7B4146D9DD2226631D7CE", "salary_min": 60000, "salary_max": 60000, "source": "Adzuna", "id": "adzuna_1304902996310028298"}, {"title": "Senior Software Developer", "company": "Spectrum It Recruitment Limited", "location": "Bracknell, Berkshire", "description": "Senior Software Developer required by a leading Cloud Technology company based in Bracknell. The company are working on cutting-edge technology including AI and propensity modelling. This is a brand-new position due to growth and will join a well-established, high calibre development team. The company operate on a hybrid model which involves 3 days in the office and 2 days from home. Essential experience: Degree in Computer Science or other STEM subject ideally from a Russell Group University 5…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5101296286?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=131563A866BDE5CEB07FEE7D0374714E7B646077", "salary_min": 85000, "salary_max": 85000, "source": "Adzuna", "id": "adzuna_-2695062122261341752"}, {"title": "Software Development Apprenticeship", "company": "Baltic Apprenticeships", "location": "Newcastle International Airport, Woolsington", "description": "Calling all aspiring Software Developers We have a fantastic role available now with client looking to grow their team Baltic Apprenticeships are back in partnership with LM Global who are specialists in providing communications and business systems to SME, mid-market, enterprise and public sector organisations. Allowing organisations to work anywhere, productively and securely. LM Global are also keen for the successful candidate to potential enrol onto a higher level apprenticeship upon succe…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5087513053?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=8EA9153AD25A5E9BF591E8C123360612F652CC21", "salary_min": 16000, "salary_max": 16000, "source": "Adzuna", "id": "adzuna_9105833177500860724"}, {"title": "Embedded Software Developer", "company": "Ecruit", "location": "South East London, London", "description": "Embedded Software Developer Software - London, Greater London (Hybrid) Sportable is a leading sports technology company on a mission to solve the hardest problems in elite sports using cutting edge technology. From bare metal to cloud Sportable is a multidisciplinary mecca for sports and technology enthusiasts. If you're a data scientist, computer scientist, physicist, sports scientist, engineer, business graduate, graphic designer, mechanical designer, creative or just passionate about the int…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5101297064?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=5E6A88176FF0C72D9484F680DF0508865F15E72C", "salary_min": 65000, "salary_max": 65000, "source": "Adzuna", "id": "adzuna_2171948662560808572"}, {"title": "Principal Software Developer", "company": "Spectrum It Recruitment Limited", "location": "London, UK", "description": "Principal Software Developers required for an excellent client who are in the trading industry and their office is based in the City of London. The successful Principal Software Developer will join a small but extremely talented development team. You will be exposed to creating and maintaining our client's own applications based around a C#/.NET/SQL Server/ASP.NET universe. Many projects are greenfield projects and allow you to make your own mark on the development process early on.You will be …", "url": "https://www.adzuna.co.uk/jobs/land/ad/5103609900?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=0424B7A151BC874C6C41DC0E73D0CB46045AC4E4", "salary_min": 100000, "salary_max": 100000, "source": "Adzuna", "id": "adzuna_4408228892205781960"}, {"title": "C++ Software Developer", "company": "La Fosse Academy", "location": "Cambridge, Cambridgeshire", "description": "C++ Developer | Tech for Good | Up to £70K per annum base | Mostly Remote - UK office (Offices in Scotland and East England if you prefer to work on site) Imagine a powerhouse in intelligence analysis, crafting cutting-edge solutions for those who navigate the world's most complex data landscapes. With roots tracing back to 1990, this innovative force has been transforming raw information into actionable insights, equipping experts across military, law enforcement, and commercial sectors with t…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5098680635?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=AF655DC39B6A3030126E37A6F882D32CE19ED980", "salary_min": 70000, "salary_max": 70000, "source": "Adzuna", "id": "adzuna_-5953574315326032914"}, {"title": "Teamcentre Software Developer", "company": "Quest Global Engineering Limited", "location": "Huddersfield, West Yorkshire", "description": "Quest Global is an organization at the forefront of innovation and one of the worlds fastest growing engineering services firms with deep domain knowledge and recognized expertise in the top OEMs across seven industries. We are a twenty-five-year-old company on a journey to becoming a centenary one, driven by aspiration, hunger and humility. We are looking for humble geniuses, who believe that engineering has the potential to make the impossible, possible; innovators, who are not only inspired …", "url": "https://www.adzuna.co.uk/jobs/land/ad/5093127627?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=2404639E6DE8D6D033194B6D501DA222DA123038", "salary_min": 53261.9, "salary_max": 53261.9, "source": "Adzuna", "id": "adzuna_-1548770813259591972"}, {"title": "Senior Software Developer - Python (On-site)", "company": "Ocho", "location": "Belfast, Northern Ireland", "description": "Senior Software Developer - Python (On-site) Company Overview: My client is an industry leader in the Meditech sector. As part of their continued growth, they are seeking a Senior Software Developer to join their team. This is an exciting opportunity to work on impactful projects, using cutting-edge technologies, in a flexible, hybrid working environment. The Role: As a Senior Software Developer, you will be responsible for designing, developing, and maintaining scalable and high-performance ap…", "url": "https://www.adzuna.co.uk/jobs/land/ad/5100378774?se=XtYRzaIH8BGSfKkdzLWCew&utm_medium=api&utm_source=54a421de&v=D9AB7DDF60F8D3DEB678998A23812EA29EA43790", "salary_min": 60000, "salary_max": 60000, "source": "Adzuna", "id": "adzuna_1113367623557739304"}], "timestamp": 1742705627.022985}}